Demo_Kabeli/src/InformationRegisters/ДанныеПоЖурналамКабельнойПродукции/ДанныеПоЖурналамКабельнойПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПоЖурналамКабельнойПродукции</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЖруналКабелей</types>
    </type>
  </resources>
  <resources>
    <name>ДлинаФактическая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлинаАннулировано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерЗаявкиПодтверждения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявкиПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИКЖ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИКЖ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОригиналИКЖ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапСтроительства</name>
    <type>
      <types>CatalogRef.ЭтапыСтроительства</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>299</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспертНаправлений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиВМонтаж</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтчетаОМонтаже</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИКЖЧерновик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетОМонтаже</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЖурналУчетаКабельнойЛинии</name>
    <type>
      <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Трассировка</name>
    <type>
      <types>CatalogRef.Трассировка</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Demo_Kabeli/src/InformationRegisters/ДанныеПоМонтажуКабельнойПродукции/ДанныеПоМонтажуКабельнойПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПоМонтажуКабельнойПродукции</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыМонтажа</types>
    </type>
  </resources>
  <resources>
    <name>ДлинаФактическая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЖурналУчетаКабельнойЛинии</name>
    <type>
      <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Demo_Kabeli/src/Enums/СтатусыЖруналКабелей/СтатусыЖруналКабелей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЖруналКабелей</name>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
</mdclass:Enum>

Demo_Kabeli/src/CommonModules/СтатусыПроверкаСервер/Module.bsl
Функция ЖурналКабельнойЛинииПодписан(ЖурналУчетаКабельнойПродукции) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;		
	Запрос.УстановитьПараметр("ЖурналУчетаКабельнойЛинии", ЖурналУчетаКабельнойПродукции);
	Запрос.Текст = "ВЫБРАТЬ
	               |	1 КАК Поле1
	               |ИЗ
	               |	РегистрСведений.ДанныеПоЖурналамКабельнойПродукции.СрезПоследних(, ЖурналУчетаКабельнойЛинии = &ЖурналУчетаКабельнойЛинии) КАК ДанныеПоЖурналамКабельнойПродукцииСрезПоследних
	               |ГДЕ
	               |	ДанныеПоЖурналамКабельнойПродукцииСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЖруналКабелей.Подписан)";
	
	Результат = Запрос.Выполнить();	
	Возврат Не Результат.Пустой();
	
КонецФункции

Функция ЖурналКабельнойЛинииСмонтирован(ЖурналУчетаКабельнойПродукции) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;		
	Запрос.УстановитьПараметр("ЖурналУчетаКабельнойЛинии", ЖурналУчетаКабельнойПродукции);
	Запрос.Текст = "ВЫБРАТЬ
	               |	1 КАК Поле1
	               |ИЗ
	               |	РегистрСведений.ДанныеПоМонтажуКабельнойПродукции.СрезПоследних(, ЖурналУчетаКабельнойЛинии = &ЖурналУчетаКабельнойЛинии) КАК ДанныеПоМонтажуКабельнойПродукцииСрезПоследних
	               |ГДЕ
	               |	ДанныеПоМонтажуКабельнойПродукцииСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыМонтажа.Выполнен)";
	
	Результат = Запрос.Выполнить();	
	Возврат Не Результат.Пустой();
	
КонецФункции
